export interface ConsultationDetails {
  includes: string;
  additional?: { key: string; value: string }[]; // Масив об'єктів {key, value}
  duration?: string; // Необов'язкове, бо не у всіх є тривалість
  conditions?: string; // Необов'язкове, бо не у всіх є умови
  format?: string; // Необов'язкове, бо не у всіх є формат
}

export interface Consultation {
  title: string;
  price: string; // Може бути пустим, якщо ціна індивідуальна
  details: ConsultationDetails;
  paymentLink: string;
}

export interface ServicePrices {
  matrix: Consultation[];
  games: Consultation[];
  numerology: Consultation[];
}

export const localizedTitles = {
  "deep_vip_consultation_on_the_matrix_of_fate": "Глибинна VIP консультація по матриці долі",
  "individual_consultation_on_the_matrix_of_fate_express": "Індивідуальна консультація по матриці долі Express",
  "consultation_on_the_matrix_of_pair_compatibility": "Консультація по матриці сумісності пари або партнерів",
  "individual_consultation_on_the_child_matrix_of_fate": "Індивідуальна консультація по дитячій матриці долі",
  "express_consultation_on_the_child_matrix_of_fate": "Експрес-консультація по дитячій матриці долі",
  "individual_consultation_on_the_child_fears_and_blocks": "Індивідуальна консультація: Страхи і блоки дитини",
  "deep_financial_consultation_where_are_my_money": "Глибинна фінансова консультація: Де мої гроші?",
  "forecast_for_the_period": "Прогноз на період",
  "emergency_forecast_for_the_event": "Терміновий прогноз на подію",
  "lila_individual_game": "Ліла - індивідуальна гра",
  "lila_group_game": "Ліла - групова гра",
  "9_worlds_individual_game": "9 світів - індивідуальна гра",
  "9_worlds_group_game": "9 світів - групова гра",
  "deep_numerology_consultation": "Глибинна нумерологічна консультація"
};
export type localizedTitlesType = typeof localizedTitles;

const paymentUrl = 'https://book.stripe.com/'
const stripeServiceId = {
  "deep_vip_consultation_on_the_matrix_of_fate": 'test_3csfZV8Cm5argZG289',
  // "individual_consultation_on_the_matrix_of_fate_express",
  // "consultation_on_the_matrix_of_pair_compatibility",
  // "individual_consultation_on_the_child_matrix_of_fate",
  // "express_consultation_on_the_child_matrix_of_fate",
  // "individual_consultation_on_the_child_fears_and_blocks",
  // "deep_financial_consultation_where_are_my_money",
  // "forecast_for_the_period",
  // "emergency_forecast_for_the_event",
  // "lila_individual_game",
  // "lila_group_game",
  // "9_worlds_individual_game",
  // "9_worlds_group_game",
  // "deep_numerology_consultation"
}

export const Prices: ServicePrices = {
  matrix: [
    {
      title: 'Глибинна VIP консультація по матриці долі',
      price: '150€',
      details: {
        includes: 'Карта здоровʼя та аналіз чакральної системи',
        additional: [
          {
            key: 'Особисті якості',
            value:
              '( Характер, сильні і слабкі сторони, звідки ви можете черпати енергію, ресурс, місця сили, в чому Ваша супер сила ) Аналіз Особистості.',
          },
          { key: 'Повний опис талантів', value: 'від Бога і Рода.' },
          { key: 'Призначення', value: '(особисте, соціальне, духовне).' },
          {
            key: 'Фінансовий канал.',
            value:
              'Ви дізнаєтесь, де ховається справжній потік фінансів, щоб заробляти гроші легко та із задоволенням. Активація грошового потоку. Список найуспішніших професій.',
          },
          {
            key: 'Карма минулого життя',
            value: ', які кармічні задачі стоять перед Вами в цьому житті.',
          },
          {
            key: 'Додаткові програми',
            value: ', які впливають на Вашу долю та на які сфери життя.',
          },
          {
            key: 'Канал відносин:',
            value:
              ' Як створити гармонічні відносини, ідеальний партнер для Вас, сексуальність.',
          },
          {
            key: 'Родові програми, ',
            value: ', відносини з батьками / дітьми.',
          },
          {
            key: "Рекомендації по здоров'ю",
            value: '(карта здоров’я по чакральній системі).',
          },
          { key: 'Керівництво по життю', value: '' },
          {
            key: 'Особистий бренд: ',
            value: 'самовираження в блозі (коротко).',
          },
          { key: 'Відео-консультація Zoom ', value: '' },
        ],
        duration: '1,5 - 2 години',
        conditions: 'Умови проведення вказуються індивідуально',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Індивідуальна консультація по матриці долі Express',
      price: '70€',
      details: {
        includes: 'Що входить в консультацію уточнюється під час запису',
        additional: [
          {
            key: 'Особисті якості',
            value: '( Характер, сильні і слабкі сторони) Аналіз Особистості.',
          },
          { key: 'Таланти', value: 'Повний опис талантів від Бога і Рода.' },
          {
            key: 'Призначення',
            value: '(особисте, соціальне, духовне - коротко)',
          },
          {
            key: 'Фінансовий канал',
            value:
              'Ви дізнаєтесь, де ховається справжній потік фінансів, щоб заробляти гроші легко та із задоволенням.',
          },
          {
            key: 'Карма',
            value:
              'Карма минулого життя, які кармічні задачі стоять перед Вами в цьому житті.',
          },
          {
            key: 'Додаткові програми',
            value: 'Додаткові програми, які впливають на Вашу долю.',
          },
          {
            key: 'Канал відносин',
            value:
              'Як створити гармонічні відносини, ідеальний партнер для Вас, сексуальність.',
          },
          { key: 'Родові програми', value: 'Відносини з батьками / дітьми.' },
          { key: 'Керівництво по життю', value: '' },
        ],
        duration: '45 хв',
        conditions: 'Умови проведення вказуються індивідуально',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Консультація по матриці сумісності пари або партнерів',
      price: '80€',
      details: {
        includes: 'Що входить в консультацію уточнюється під час запису',
        additional: [
          {
            key: 'У позитиві сценарію пари',
            value: `- Для чого зустрілися - Як проявляється пара - Що важливо для фінансового благополуччя і щасливих стосунків`,
          },
          {
            key: 'У негативному сценарію пари',
            value: `- Проблеми і труднощі - Якщо пара не виконує те, для чого зустрілася`,
          },
          {
            key: 'Зона комфорту пари',
            value: `- Зона комфорту в стосунках - Взаємини партнерів`,
          },
          {
            key: 'Рекомендації для пари',
            value: `- Завдання пари для "притирання" у стосунках - Завдання пари для успішної реалізації в соціумі - Ресурс пари`,
          },
        ],
        duration: '1 година',
        conditions: 'Умови проведення вказуються індивідуально',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Індивідуальна консультація по дитячій матриці долі',
      price: '35€',
      details: {
        includes: 'Що входить в консультацію уточнюється під час запису',
        additional: [
          { key: 'Сильні сторони і таланти дитини', value: '' },
          {
            key: 'Тривожні дзвіночки в поведінці',
            value: 'Які варто зауважити.',
          },
          {
            key: 'Підхід до дитини',
            value:
              'Як знайти підхід до вашої дитини і налагодити комунікацію (Мислення дитини).',
          },
          {
            key: 'Гуртки для розвитку',
            value: 'Підберемо гуртки, які розкриють дитину.',
          },
          {
            key: 'Вибір професії',
            value: 'Підберемо професію, яка приноситиме задоволення і гроші.',
          },
          {
            key: 'Уроки для батьків',
            value: 'Які уроки ваша дитина принесла у ваше життя.',
          },
          { key: 'Страхи і блоки', value: 'Страхи і блоки на підсвідомості.' },
        ],
        duration: '45 хв',
        conditions: 'Умови проведення вказуються індивідуально',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Експрес-консультація по дитячій матриці долі',
      price: '30€',
      details: {
        includes: 'Короткий аналіз основних сильних сторін і рекомендацій.',
        additional: [
          { key: 'Сильні сторони', value: 'Основні таланти дитини.' },
          { key: 'Поведінка', value: 'Короткий аналіз поведінкових патернів.' },
          {
            key: 'Рекомендації',
            value: 'Основні поради для виховання і розвитку.',
          },
        ],
        duration: '30 хвилин',
        conditions: 'Консультація доступна як онлайн, так і офлайн.',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Індивідуальна консультація: Страхи і блоки дитини',
      price: '40€',
      details: {
        includes: 'Аналіз підсвідомих страхів та рекомендації по їх подоланню.',
        additional: [
          { key: 'Страхи', value: 'Виявлення блоків на підсвідомості.' },
          {
            key: 'Батьківські уроки',
            value: 'Що ваша дитина може навчити вас як батьків.',
          },
        ],
        duration: '45 хвилин',
        conditions:
          'Консультація може бути проведена лише в індивідуальному порядку.',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Глибинна фінансова консультація “Де мої гроші”',
      price: '100€',
      details: {
        includes:
          'Консультація допомагає знайти причини фінансових блоків та відкриває нові можливості для фінансового зростання.',
        additional: [
          {
            key: 'Фінансовий канал',
            value:
              'Аналіз фінансового потоку та виявлення джерел його блокування.',
          },
          {
            key: 'Причини обмежень',
            value:
              'Дослідження кармічних програм або підсвідомих переконань, які впливають на фінансову стабільність.',
          },
          {
            key: 'Можливості зростання',
            value:
              'Індивідуальні рекомендації щодо напрямків розвитку та оптимальних шляхів для отримання доходу.',
          },
          {
            key: 'Особисті таланти',
            value:
              'Які ваші сильні сторони можна використати для легшого заробітку.',
          },
          {
            key: 'Фінансова стратегія',
            value: 'Побудова плану для залучення більшого потоку грошей.',
          },
        ],
        duration: '1 година',
        conditions:
          'Умови проведення вказуються індивідуально залежно від клієнта.',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Прогноз на період (дата, місяць, квартал, рік)',
      price: '',
      details: {
        includes:
          'Прогноз допоможе зрозуміти основні тенденції періоду та підготуватись до можливих викликів і можливостей. Вартість розраховується індивідуально залежно від обраного періоду.',
        additional: [
          {
            key: 'Енергетичний потенціал',
            value:
              'Які енергії будуть домінувати у вашому житті в обраний період.',
          },
          {
            key: 'Сфери життя',
            value:
              'Прогноз для основних сфер: робота, фінанси, відносини, здоровʼя.',
          },
          {
            key: 'Важливі події',
            value: 'Рекомендації щодо дій у сприятливі та несприятливі дати.',
          },
          {
            key: 'Фінансові перспективи',
            value: 'Прогноз для стабільності та зростання доходів.',
          },
          {
            key: 'Рекомендації',
            value:
              'Практичні поради щодо використання можливостей періоду на вашу користь.',
          },
        ],
        format:
          'Консультація проводиться онлайн або офлайн, залежно від домовленості.',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: 'Екстрений прогноз на подію (дата, день)',
      price: '20€',
      details: {
        includes:
          'Швидкий аналіз важливої події з урахуванням енергій дня та впливу зовнішніх факторів.',
        additional: [
          {
            key: 'Аналіз події',
            value: 'Визначення потенціалу успіху та ризиків для обраної дати.',
          },
          {
            key: 'Сприятливий час',
            value: 'Рекомендація оптимального часу для дії або початку події.',
          },
          {
            key: 'Енергетичний фон',
            value:
              'Аналіз впливу дня на вашу енергію та загальний результат події.',
          },
          {
            key: 'Рекомендації',
            value:
              'Конкретні поради для покращення результатів запланованого заходу.',
          },
        ],
        format:
          'Формат проведення уточнюється індивідуально: онлайн або офлайн.',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
  ],
  games: [
    {
      title: '«Ліла»- Індивідуальна гра',
      price: '200$',
      details: {
        includes: 'Персоналізована гра відповідно до запиту',
        additional: [
          {
            key: 'Глибоке усвідомлення себе',
            value:
              'Розуміння того, що відбувається у вашому житті та що це спричиняє.',
          },
          {
            key: 'Відповіді на важливі питання',
            value:
              'Знайдете рішення та побачите істинні причини своїх труднощів.',
          },
          {
            key: 'Підказки для дій',
            value:
              'Гра покаже вам напрямок руху та конкретні кроки для досягнення бажаного.',
          },
          {
            key: 'Енергія та натхнення',
            value:
              'Після гри відчуєте внутрішню силу, розуміння та легкість у прийнятті рішень.',
          },
        ],
        duration: '2 години',
        conditions: 'Індивідуальне налаштування під потреби учасника.',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: '«Ліла»- Групова гра',
      price: '100$',
      details: {
        includes: 'Гра в групі, розрахована на кількох учасників (2-10 осіб)',
        additional: [
          {
            key: 'Групова взаємодія',
            value:
              'Інтерактивний процес із обміну досвідом та підсвідомих підказок.',
          },
          {
            key: 'Емоційне перезавантаження',
            value:
              'Після гри учасники відчувають гармонію та легкість у прийнятті рішень.',
          },
        ],
        duration: '2-4 години',
        conditions: 'Формат гри узгоджується індивідуально',
      },
      paymentLink: 'https://paymentlink2.com',
    },
    {
      title: '«9 Світів»- Індивідуальна гра',
      price: '250$',
      details: {
        includes: 'Трансформаційний шлях через 9 рівнів пізнання',
        additional: [
          {
            key: 'Глибоке самопізнання',
            value:
              'Ви усвідомите свої справжні бажання, мотиви та підсвідомі установки.',
          },
          {
            key: 'Розкриття внутрішніх блоків',
            value:
              'Виявлення страхів, переконань та емоційних затискачів, які обмежують вас.',
          },
          {
            key: 'Прорив у важливій сфері життя',
            value:
              "Отримаєте чітке розуміння та напрямок руху щодо стосунків, кар'єри, фінансів або духовного шляху.",
          },
          {
            key: 'Відповіді на ключові питання',
            value:
              'Гра працює як дзеркало вашої душі, розкриваючи те, що впливає на вас.',
          },
          {
            key: 'Емоційне перезавантаження',
            value:
              'Після гри ви відчуєте легкість, ясність і внутрішню гармонію.',
          },
        ],
        duration: '2-3 години',
        conditions: 'Формат гри узгоджується індивідуально',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
    {
      title: '«9 Світів»- Групова гра',
      price: '150$',
      details: {
        includes: 'Групова гра з глибоким трансформаційним процесом (2-8 осіб)',
        additional: [
          {
            key: 'Групова динаміка',
            value:
              'Колективна робота дозволяє відкрити нові перспективи через взаємодію з іншими учасниками.',
          },
          {
            key: 'Гармонія та ясність',
            value:
              'Гра дає можливість відчути ясність, гармонію та нові можливості в житті.',
          },
        ],
        duration: '3-4 години',
        conditions: 'Формат гри узгоджується індивідуально',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
  ],
  numerology: [
    {
      title: 'Глибока нумерологічна консультація',
      price: '150$',
      details: {
        includes: 'Комплексний аналіз вашої дати народження',
        additional: [
          {
            key: 'Число свідомості',
            value: 'Основна енергія, що визначає характер та сильні сторони.',
          },
          {
            key: 'Місія життя',
            value: 'Ваше головне призначення та як його реалізувати.',
          },
          {
            key: 'Ідеальна професія',
            value: 'Сфера, у якій ви знайдете своє покликання.',
          },
          {
            key: 'Грошовий код',
            value: 'Як правильно взаємодіяти з фінансами для достатку.',
          },
          {
            key: 'Ключ до гармонійних стосунків',
            value: 'Як будувати здорові відносини та уникати помилок.',
          },
          {
            key: 'Ресурси та джерела енергії',
            value: 'Що вас наповнює, а що виснажує.',
          },
          {
            key: 'Кармічні задачі',
            value: 'Уроки, які потрібно засвоїти в цьому житті.',
          },
          {
            key: 'Сумісність з іншими',
            value: 'Як гармонійно взаємодіяти з людьми.',
          },
          {
            key: 'Прогноз на рік',
            value: 'Сприятливі періоди та важливі події.',
          },
        ],
        duration: '2 години',
        conditions:
          'Консультація проходить онлайн. Ви отримуєте персональний розбір та рекомендації.',
      },
      paymentLink: paymentUrl + stripeServiceId.deep_vip_consultation_on_the_matrix_of_fate,
    },
  ],
};
