import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';
import { RouterModule } from '@angular/router';

@Component({
  selector: 'app-marquee',
  standalone: true,
  imports: [CommonModule, RouterModule],
  templateUrl: './marquee.component.html',
  styleUrl: './marquee.component.scss',
})
export class MarqueeComponent {
  splashes = [
    {
      text: 'Відчуваєте тривогу? Глибинна VIP консультація по матриці долі допоможе розібратись!',
      route: '/'
    },
    {
      text: 'Хочете гармонійних стосунків? Консультація по матриці сумісності пари або партнерів покаже ваш шлях!',
      route: '/'
    },
    {
      text: 'Думаєте про майбутнє дитини? Індивідуальна консультація по дитячій матриці долі допоможе знайти відповіді!',
      route: '/'
    },
    // {
    //   text: 'Потрібно швидко розібратись? Експрес-консультація по дитячій матриці долі — все коротко і по суті!',
    //   route: '/'
    // },
    // {
    //   text: 'Не знаєте, як знайти фінансовий потік? Глибинна фінансова консультація “Де мої гроші” стане вашим проводирем!',
    //   route: '/'
    // },
    // {
    //   text: 'Не впевнені в завтрашньому дні? Прогноз на період допоможе підготуватись до важливих змін!',
    //   route: '/'
    // },
    // {
    //   text: 'Хвилює конкретна дата? Екстрений прогноз на подію дасть чіткі рекомендації!',
    //   route: '/'
    // },
    // {
    //   text: 'Шукаєте свою суперсилу? Глибинна VIP консультація по матриці долі відкриє ваші таланти!',
    //   route: '/'
    // },
    // {
    //   text: 'Потрібен швидкий аналіз? Індивідуальна консультація по матриці долі Express відповість на ваші питання!',
    //   route: '/'
    // },
    // {
    //   text: 'Не розумієте, що заважає вашим фінансам? Глибинна фінансова консультація допоможе знайти причину!',
    //   route: '/'
    // },
    // {
    //   text: 'Ваші стосунки у кризі? Консультація по матриці сумісності допоможе гармонізувати пару!',
    //   route: '/'
    // },
    // {
    //   text: 'Дитина має страхи? Індивідуальна консультація: Страхи і блоки дитини знайде рішення!',
    //   route: '/'
    // },
    // {
    //   text: 'Бажаєте більше гармонії? Глибинна VIP консультація відкриє вам нові перспективи!',
    //   route: '/'
    // },
    // {
    //   text: 'Не знаєте, який напрям обрати? Індивідуальна консультація по матриці долі допоможе зробити вибір!',
    //   route: '/'
    // },
    // {
    //   text: 'Маєте важливу подію? Екстрений прогноз на подію забезпечить необхідні відповіді!',
    //   route: '/'
    // },
    // {
    //   text: 'Хочете зрозуміти, як підтримати дитину? Індивідуальна консультація по дитячій матриці долі стане у нагоді!',
    //   route: '/'
    // },
    // {
    //   text: 'Плануєте великі зміни? Прогноз на період дасть чітку картину!',
    //   route: '/'
    // },
    // {
    //   text: 'Відчуваєте фінансовий застій? Глибинна фінансова консультація покаже, як його подолати!',
    //   route: '/'
    // },
    // {
    //   text: 'Мрієте знайти себе? Глибинна VIP консультація відкриє ваш потенціал!',
    //   route: '/'
    // },
    // {
    //   text: 'Потрібен швидкий аналіз ситуації? Експрес-консультація по дитячій матриці долі стане оптимальним рішенням!',
    //   route: '/'
    // },
    // {
    //   text: 'Хочете знайти гармонію у стосунках? Консультація по матриці сумісності розкриє секрети вашої пари!',
    //   route: '/'
    // },
    // {
    //   text: 'Вашій дитині потрібна підтримка? Індивідуальна консультація по дитячій матриці долі допоможе зрозуміти її!',
    //   route: '/'
    // },
    // {
    //   text: 'Хочете дізнатись, що чекає попереду? Прогноз на період створений для вас!',
    //   route: '/'
    // },
    // {
    //   text: 'Не знаєте, як розкрити таланти дитини? Експрес-консультація допоможе знайти відповідь!',
    //   route: '/'
    // },
    // {
    //   text: 'Шукаєте ідеальний час для події? Екстрений прогноз дасть точну відповідь!',
    //   route: '/'
    // },
    // {
    //   text: 'Потрібен план для фінансового успіху? Глибинна фінансова консультація стане вашим путівником!',
    //   route: '/'
    // },
    // {
    //   text: 'Не знаєте, з чого почати зміни? Індивідуальна консультація по матриці долі стане вашим стартом!',
    //   route: '/'
    // },
    // {
    //   text: 'Хочете покращити фінансову стабільність? Глибинна фінансова консультація створена саме для вас!',
    //   route: '/'
    // },
    // {
    //   text: 'Бажаєте гармонії в стосунках? Консультація по матриці сумісності допоможе досягти цього!',
    //   route: '/'
    // },
    // {
    //   text: 'Не знаєте, як допомогти дитині? Індивідуальна консультація покаже найкращий шлях!',
    //   route: '/'
    // },
    // {
    //   text: 'Плануєте новий проєкт? Прогноз на період покаже найкращий час для старту!',
    //   route: '/'
    // },
    // {
    //   text: 'Мрієте про більше впевненості? Індивідуальна консультація по матриці долі стане вашим орієнтиром!',
    //   route: '/'
    // },
    // {
    //   text: 'Хочете зрозуміти дитячі страхи? Консультація допоможе їх подолати!',
    //   route: '/'
    // },
    // {
    //   text: 'Не впевнені у виборі професії? Глибинна VIP консультація допоможе знайти правильний напрям!',
    //   route: '/'
    // },
    // {
    //   text: 'Потрібно знайти гармонію в житті? Індивідуальна консультація стане вашим першим кроком!',
    //   route: '/'
    // },
    // {
    //   text: 'Не знаєте, з чого почати зміни? Прогноз на період надасть чітку картину!',
    //   route: '/'
    // },
    // {
    //   text: 'Маєте питання щодо майбутнього? Індивідуальна консультація по матриці долі знайде відповіді!',
    //   route: '/'
    // },
    // {
    //   text: 'Відчуваєте сумніви щодо дитини? Експрес-консультація по дитячій матриці долі розставить усе по місцях!',
    //   route: '/'
    // },
    // {
    //   text: 'Хочете досягти успіху? Глибинна фінансова консультація відкриє нові горизонти!',
    //   route: '/'
    // },
    // {
    //   text: 'Потребуєте порад для стосунків? Консультація по матриці сумісності стане вашим провідником!',
    //   route: '/'
    // },
    // {
    //   text: 'Бажаєте зрозуміти, чому щось не працює? Індивідуальна консультація по матриці долі відповість!',
    //   route: '/'
    // },
    // {
    //   text: 'Шукаєте підтримки? Глибинна VIP консультація надасть необхідну впевненість!',
    //   route: '/'
    // },
    // {
    //   text: 'Хвилює майбутнє дитини? Консультація по дитячій матриці долі стане вашим ключем!',
    //   route: '/'
    // },
  ]

}
